"""Задача №3. Решение в группах
В некоторой школе решили набрать три новых
математических класса и оборудовать кабинеты для
них новыми партами. За каждой партой может сидеть
два учащихся. Известно количество учащихся в
каждом из трех классов. Выведите наименьшее
число парт, которое нужно приобрести для них.
Input: 20 21 22(ввод чисел НЕ в одну строку)
Output: 32"""

"""a = input("Введите число учеников для первого класса:")
b = input("Введите число учеников для второго класса:")
c = input("Введите число учеников для третьего класса:")
print(a % 2 + a // 2 + b % 2 + b // 2 + c % 2 + c // 2)"""


a = 20
b = 21
c = 22

print(a % 2 + a // 2 + b % 2 + b // 2 + c % 2 + c // 2)