"""
Задача №1. Решение в группах
Семинар 1. Ввод-вывод, операторы ветвления
За день машина проезжает n километров. Сколько
дней нужно, чтобы проехать маршрут длиной m
километров? При решении этой задачи нельзя
пользоваться условной инструкцией if и циклами.

Input:
n = 700
m = 750

Output:
2
"""

"""n = 700
m = 750
t = (m + n) // n

print(t)"""

n = 700
m = 2100
res = (n + m-1) // n
print(res)
